<?php

namespace App\Enums;

enum PrintJobStatus: int
{
    const string LANG_PREFIX = 'enum.print_job_status.';

    case PRINTING = 0; // Друкується
    case COMPLETED = 1; // Завершено
    case CANCELLED = 2; // Скасовано
    case UNKNOWN = 3; // Невідомо. Це трапляється, якщо починається новий друк, а старий ще не завершився.
    // Тобто в базі даних є запис про старий друк, але вже  прийшла подія про новий друк.
    // В такому випадку старий друк не скасовується, а стає UNKNOWN.
    // Це потрібно для того, щоб не зберігати в базі даних статус старого друку для подальшого з'ясування

}
