<?php

return [
    'buttons' => [
        'block' => 'Заблокувати',
        'unblock' => 'Розблокувати',
    ],
    'user' => [
        'card' => 'Картка користувача',
        'list' => 'Список користувачів',
        'user' => 'Користувач',
        'name' => 'Ім\'я',
        'email' => 'Електронна пошта',
        'status' => 'Статус',
        'registration_date' => 'Дата реєстрації',
        'id' => 'ID',
        'cannot_delete_admin' => 'Не можна видалити адміністратора',
        'confirm_block' => 'Ви впевнені, що хочете заблокувати цього користувача?',
        'confirm_delete' => 'Ви впевнені, що хочете видалити цього користувача?',
    ],
];
