<?php

return [
    'actions'           => 'Дії',
    'confirm'           => [
        'delete' => [
            'title' => 'Видалення запису',
            'text'  => 'Ви впевнені, що хочете видалити цей запис?',
        ],
    ],
    'buttons'           => [
        'save'    => 'Зберегти',
        'cancel'  => 'Скасувати',
        'edit'    => 'Редагувати',
        'add'     => 'Додати',
        'back'    => 'Назад',
        'delete'  => 'Видалити',
        'confirm' => 'Підтвердити',
        'clear'   => 'Очистити',
    ],
    'status'            => 'Статус',
    'name'              => 'Назва',
    'quantity'          => 'Кількість',
    'validation_errors' => 'Помилки валідації',
    'error'             => [
        'something_went_wrong' => 'Виникла помилка при виконанні дії',
    ],
    'select'            => '- оберіть -',
];
