<?php
return [
    'cannot_delete' => 'Неможливо видалити деталь, оскільки до неї прив’язані завдання.',
    'waiting_for_all_chunks' => 'Очікування завантаження всіх частин файлу...',
    'upload_error' => 'Помилка завантаження файлу: ',
    'chunk_missing' => 'Частину файлу :i не знайдено. Спробуйте завантажити файл заново.',
    'file_size_mismatch' => 'Розмір отриманого файлу не відповідає очікуваному. Спробуйте завантажити файл заново.',
    'merge_error' => 'Помилка при об’єднанні файлу: ',
];

