<?php
return [
    'id'                     => 'ID',
    'title'                  => 'Деталі',
    'form_title'             => 'Форма деталі',
    'name'                   => 'Назва деталі',
    'name_full'              => 'Деталь',
    'version'                => 'Версія',
    'version_date'           => 'Дата версії',
    'add'                    => 'Додати деталь',
    'not_found_or_not_owned' => 'Вказана модель не знайдена або вам не належить',
    'no_parts'               => 'Деталі не знайдені',
    'cannot_delete'          => 'Не можливо видалити деталь, оскільки вона використовується в завданнях',
    'catalog'                => [
        'title'                 => 'Розділ',
        'titles'                => 'Розділи',
        'form_title'            => 'Форма розділу',
        'add'                   => 'Додати розділ',
        'select_catalog'        => '(виберіть розділ)',
        'select_catalog_prompt' => 'Виберіть розділ',
        'name'                  => 'Назва розділу',
        'parent'                => 'Батьківський розділ',
        'no_parent'             => '(кореневий розділ)',
        'cannot_delete'         => 'Неможливо видалити розділ, оскільки він містить підрозділи або деталі',
    ],

    'waiting_for_all_chunks' => 'Очікування завантаження всіх частин файлу...',
    'upload_error' => 'Помилка завантаження файлу: ',
    'chunk_missing' => 'Частину файлу :i не знайдено. Спробуйте завантажити файл заново.',
    'file_size_mismatch' => 'Розмір отриманого файлу не відповідає очікуваному. Спробуйте завантажити файл заново.',
    'merge_error' => 'Помилка при об’єднанні файлу: ',
];

