<?php

return [
    'title'                    => 'Принтери',
    'form_title'               => 'Форма принтера',
    'id'                       => 'ID',
    'name'                     => 'Назва принтера',
    'add'                      => 'Додати принтер',
    'confirm_delete'           => 'Ви впевнені, що хочете видалити цей принтер?',
    'confirm_delete_task'      => 'Ви впевнені, що хочете видалити активний друк?',
    'print_count'              => 'Кількість',
    'printing'                 => 'Друк',
    'add_printing'             => 'Додати друк',
    'select_task'              => 'Виберіть завдання',
    'select_part'              => 'Виберіть частину',
    'printing_tasks_purged'    => 'Завдання на друк видалено',
    'printing_tasks_completed' => 'Завдання на друк завершено',
    'confirm'                  => [
        'complete_print' => [
            'title' => 'Відмітити як надруковане?',
            'text'  => '(кількість надрукованих частин буде додана до відповідних завдань)',
        ],
    ],
    'status'                   => [
        'active'   => 'Активний',
        'inactive' => 'Не працює',
        'deleted'  => 'Видалений',
        'printing' => 'Виконується друк',
    ],
    'validation'               => [
        'printer_id' => 'Немає принтерів для ведення обліку друку',
        'printer'    => [
            'required' => 'Принтер не зазначений',
            'exists'   => 'Принтер не знайдено',
        ],
    ],
];
