<?php

return [
    'title'          => 'Принтери',
    'form_title'     => 'Форма принтера',
    'id'             => 'ID',
    'name'           => 'Назва принтера',
    'add'            => 'Додати принтер',
    'confirm_delete' => 'Ви впевнені, що хочете видалити цей принтер?',
    'confirm_delete_task' => 'Ви впевнені, що хочете видалити активний друк?',
    'print_count'    => 'Кількість',
    'printing'       => 'Друк',
    'add_printing'   => 'Додати друк',
    'status'         => [
        'active'   => 'Активний',
        'inactive' => 'Не працює',
        'deleted'  => 'Видалений',
        'printing' => 'Виконується друк',
    ],
];
