<?php

return [
    'title'      => 'Налаштування',
    'api_tokens' => [
        'title'                => 'API токени',
        'token'                => 'Токен',
        'created'              => 'Створено',
        'last_used'            => 'Останнє використання',
        'create'               => 'Створити токен',
        'delete_confirm_title' => 'Видалення токену',
        'delete_confirm_text'  => 'Ви впевнені, що хочете видалити цей токен? Це призведе до втрати доступу для сервісів, які його використовують.',
    ],
];
